nxp-mcuxpresso/mcuxsdk-examples/_boards/imx943evk/modbus_examples/rtu/modbus_client/cm33_core1/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 0.15.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

 #include "pin_mux.h"
 
 void BOARD_InitGPIOPins(void);
 /* FUNCTION ************************************************************************************************************
  * 
  * Function Name : BOARD_InitBootPins
  * Description   : Calls initialization functions.
  * 
  * END ****************************************************************************************************************/
 void BOARD_InitBootPins(void) {
     BOARD_InitGPIOPins();
 }

 /*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33}
- pin_list:
  - {pin_num: F20, peripheral: LPUART2, signal: lpuart_rx, pin_signal: UART2_RXD, HYS: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: NO_DRIVE}
  - {pin_num: F21, peripheral: LPUART2, signal: lpuart_tx, pin_signal: UART2_TXD, HYS: DISABLED, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: L17, peripheral: GPIO2, signal: 'gpio_io, 04', pin_signal: GPIO_IO04, HYS: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitGPIOPins(void) {                                /*!< Function assigned for the core: undefined[cm33] */

  IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO31__GPIO2_IO31, 0U);
  IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO01__GPIO2_IO1, 0U);

  IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO31__GPIO2_IO31,
                      IOMUXC_PAD_DSE(15U) |
                      IOMUXC_PAD_FSEL1(2U) |
                      IOMUXC_PAD_PD_MASK);
  
  IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO01__GPIO2_IO1,
                      IOMUXC_PAD_DSE(15U) |
                      IOMUXC_PAD_FSEL1(2U) |
                      IOMUXC_PAD_PD_MASK);
}
 
 /***********************************************************************************************************************
  * EOF
  **********************************************************************************************************************/
 